content/notes/what_does_it_mean_to_be_a_man.md
+++
title = "What does it mean to be a man?"
lastmod = 2021-06-16T12:17:45-07:00
draft = false
+++

Nowadays, social norms are changing faster than ever. To quote one of my favourite authors, Mark Manson, "We are either the first or second generation of men to grow up without a clear definition of what our social roles are supposed to be and without a model of what it is to be strong and attractive men."

This confusion is especially damaging to young men like myself and boys who are subjected to vastly different behavioural expectations. On one hand, we are rightfully being asked to shed elements of _toxic masculinity_ that have undeniably oppressed women and others for centuries. Yet on the other, our culture still celebrates many of these same traits.


## Misc {#misc}

> Life is a storm, my young friend. You will bask in the sunlight one moment, be shattered on the rocks the next. What makes you a man is what you do when that storm comes.
>
> — Alexandre Dumas, _The Count of Monte Cristo_